app/views/admin/items/edit.html.erb

   <label for="genre">ジャンル</label>
   <%= f.collection_select :genre_id, Genre.all, :id, :name %>
---
SELECT "genres".* FROM "genres"