app/views/admin/items/new.html.erb

  <h4>カテゴリー</h4>
  <%= f.select :name, Genre.all.map { |genre| [genre.name, genre.id] } %>
---
SELECT "genres".* FROM "genres"