app/controllers/admin/customers_controller.rb

  def index
    @customers = Customer.page(params[:page]).reverse_order
---
SELECT  "customers".* FROM "customers" ORDER BY "customers"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]

  def edit
    @customer = Customer.find(params[:id])
    if @customer = Customer.find(params[:id])
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]