app/controllers/admin/genres_controller.rb

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "genres" SET "name" = ?, "updated_at" = ? WHERE "genres"."id" = ?  [["name", "ジャンル１（変更）"], ["updated_at", "2022-04-03 15:58:42.583940"], ["id", 1]]
---
    def update
        @genre = Genre.find(params[:id])
    if  @genre.update(genre_params)