app/controllers/admin/items_controller.rb

SELECT "genres".* FROM "genres"
---
  def new
    @items = Item.all
    @item = Item.new
    @genres = Genre.all