app/controllers/admin/items_controller.rb

  def index
    @items = Item.page(params[:page]).reverse_order
    @genres = Genre.all
---
SELECT  "items".* FROM "items" ORDER BY "items"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "items"
SELECT "genres".* FROM "genres"

  def create
    @item = Item.new(item_params)
    if @item.save
---
INSERT INTO "items" ("name", "introduction", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "1"], ["introduction", "野菜の説明"], ["created_at", "2022-05-05 05:30:04.945947"], ["updated_at", "2022-05-05 05:30:04.945947"]]