app/controllers/public/cart_items_controller.rb

  def create
    cart = current_customer.prepare_cart
    item = Item.find(params[:item_id])
    cart.cart_items.create!(item_id: item.id)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at", "customer_id") VALUES (?, ?, ?)  [["created_at", "2022-06-22 11:37:50.525930"], ["updated_at", "2022-06-22 11:37:50.525930"], ["customer_id", "1"]]
INSERT INTO "cart_items" ("item_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["item_id", 1], ["cart_id", 1], ["created_at", "2022-06-26 18:50:38.170152"], ["updated_at", "2022-06-26 18:50:38.170152"]]