app/controllers/public/items_controller.rb

SELECT  "items".* FROM "items" ORDER BY "items"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
---
  def index
    @items = Item.page(params[:page]).reverse_order